app/controllers/posts_controller.rb

	def create
	  	@post = Post.new(post_params)

	  	if @post.save
---
INSERT INTO `posts` (`created_at`, `text`, `title`, `updated_at`, `user`) VALUES ('2014-03-06 07:59:33', 'derfcacd', 'Migration', '2014-03-06 07:59:33', 'ashish')

 	def show
		@post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 5 ORDER BY `posts`.`id` ASC LIMIT 1

	def update
		 @post = Post.find(params[:id])

		  if @post.update(params[:post].permit(:title, :text))
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `title` = 'First1', `text` = 'hello2112', `updated_at` = '2014-03-05 10:51:02' WHERE `posts`.`id` = 1